:PROPERTIES:
:ID:       38d0b5bb-ec7b-4fac-ae15-049071ea4108
:END:
#+TITLE: Gitforge: Querying Github GraphQL API
#+CATEGORY: slips
#+TAGS:
* Roam
+ [[id:8d789c98-5e74-4bf8-9226-52fb43c5ca51][Gitforge]]
+ [[id:7a4a7eea-5795-44e5-86e8-eec2afebf110][GraphQL]]
+ [[id:8fb0a586-9c0f-4f36-b1ab-dc5c26681d15][Open Source]]

* Using new =ghub-query=

#+name: orgRepos
#+begin_src emacs-lisp :var login="clickhouse" nrepos=(identity 100) :results vector value :exports code
(let* ((n nrepos)
       (q '(query
            [($login String!)
             ($first Int!)
             ($orderBy RepositoryOrder!)]
            (organization
             [(login $login)]
             (repositories
              [(first $first)
               (orderBy $orderBy)]
              (edges
               (node
                (owner login)
                name
                (defaultBranchRef prefix name)
                url
                updatedAt
                diskUsage
                isFork
                isArchived))))))
       (vars `((login . ,login)
               (first . ,n)
               (orderBy . ((field . "UPDATED_AT")
                           (direction . "DESC")))))
       (response (cdr (ghub-query q vars
                   :paginate 100
                   :synchronous t))))
  ;; (setq gql-response response)
  (let-alist response .organization.repositories))
#+end_src


#+name: orgBundles
#+begin_src emacs-lisp :var repos=orgRepos :results value table :exports code :noweb yes :eval query
(thread-first
  (thread-last
    repos
    ;; (a-get* (nthcdr 0 ) 'data 'organization 'repositories 'edges)
    ;; (mapcar (lambda (el) (a-get* el 'node)))

    ;; filter archived repos
    (seq-filter (lambda (el) (not (a-get* el 'isFork))))
    (seq-filter (lambda (el) (not (a-get* el 'isArchived))))

    (mapcar (lambda (el)
              (list (a-get* el 'diskUsage)
                    (a-get* el 'owner 'login)
                    (a-get* el 'defaultBranchRef 'prefix)
                    (a-get* el 'defaultBranchRef 'name)
                    (a-get* el 'name)
                    (a-get* el 'updatedAt)
                    (a-get* el 'isFork)
                    (a-get* el 'isArchived)
                    (a-get* el 'url))))))
#+end_src

#+RESULTS: orgBundles
|    2175 | ClickHouse | refs/heads/ | main   | clickhouse-cs                            | 2026-06-03T14:45:33Z | nil | nil | https://github.com/ClickHouse/clickhouse-cs                            |
|     180 | ClickHouse | refs/heads/ | main   | clickhouse-c                             | 2026-06-03T14:38:44Z | nil | nil | https://github.com/ClickHouse/clickhouse-c                             |
|    1008 | ClickHouse | refs/heads/ | main   | pg_clickhouse                            | 2026-06-03T14:38:35Z | nil | nil | https://github.com/ClickHouse/pg_clickhouse                            |
| 6781589 | ClickHouse | refs/heads/ | master | ClickHouse                               | 2026-06-03T14:33:51Z | nil | nil | https://github.com/ClickHouse/ClickHouse                               |
|     378 | ClickHouse | refs/heads/ | main   | silk                                     | 2026-06-03T14:29:36Z | nil | nil | https://github.com/ClickHouse/silk                                     |
|     448 | ClickHouse | refs/heads/ | main   | clickstack-demo-subscription-app         | 2026-06-03T14:26:31Z | nil | nil | https://github.com/ClickHouse/clickstack-demo-subscription-app         |
|  617624 | ClickHouse | refs/heads/ | main   | mintlify-docs-dev                        | 2026-06-03T14:24:29Z | nil | nil | https://github.com/ClickHouse/mintlify-docs-dev                        |
| 1266804 | ClickHouse | refs/heads/ | main   | clickhouse-docs                          | 2026-06-03T12:39:28Z | nil | nil | https://github.com/ClickHouse/clickhouse-docs                          |
|   78006 | ClickHouse | refs/heads/ | main   | ClickBench                               | 2026-06-03T12:24:28Z | nil | nil | https://github.com/ClickHouse/ClickBench                               |
|    2798 | ClickHouse | refs/heads/ | main   | clickhouse-js                            | 2026-06-03T12:12:15Z | nil | nil | https://github.com/ClickHouse/clickhouse-js                            |
|    1970 | ClickHouse | refs/heads/ | main   | terraform-provider-clickhouse            | 2026-06-03T11:58:24Z | nil | nil | https://github.com/ClickHouse/terraform-provider-clickhouse            |
|  117377 | ClickHouse | refs/heads/ | main   | examples                                 | 2026-06-03T10:31:02Z | nil | nil | https://github.com/ClickHouse/examples                                 |
|     994 | ClickHouse | refs/heads/ | main   | ClickStack                               | 2026-06-03T09:26:54Z | nil | nil | https://github.com/ClickHouse/ClickStack                               |
|    3495 | ClickHouse | refs/heads/ | main   | spark-clickhouse-connector               | 2026-06-03T08:21:02Z | nil | nil | https://github.com/ClickHouse/spark-clickhouse-connector               |
|    2688 | ClickHouse | refs/heads/ | master | clickhouse-cpp                           | 2026-06-03T08:15:18Z | nil | nil | https://github.com/ClickHouse/clickhouse-cpp                           |
|    1735 | ClickHouse | refs/heads/ | main   | clickhousectl                            | 2026-06-03T07:31:04Z | nil | nil | https://github.com/ClickHouse/clickhousectl                            |
|    1257 | ClickHouse | refs/heads/ | main   | nerve                                    | 2026-06-03T04:11:49Z | nil | nil | https://github.com/ClickHouse/nerve                                    |
|    1142 | ClickHouse | refs/heads/ | main   | dbt-clickhouse                           | 2026-06-03T02:50:15Z | nil | nil | https://github.com/ClickHouse/dbt-clickhouse                           |
|    4081 | ClickHouse | refs/heads/ | main   | clickhouse-kafka-connect                 | 2026-06-03T02:06:43Z | nil | nil | https://github.com/ClickHouse/clickhouse-kafka-connect                 |
|    2818 | ClickHouse | refs/heads/ | main   | flink-connector-clickhouse               | 2026-06-03T01:58:05Z | nil | nil | https://github.com/ClickHouse/flink-connector-clickhouse               |
|     710 | ClickHouse | refs/heads/ | main   | aspire-clickhouse-gateway-analytics-demo | 2026-06-03T01:20:59Z | nil | nil | https://github.com/ClickHouse/aspire-clickhouse-gateway-analytics-demo |
|    1369 | ClickHouse | refs/heads/ | main   | pg_stat_ch                               | 2026-06-02T23:56:52Z | nil | nil | https://github.com/ClickHouse/pg_stat_ch                               |
|    1545 | ClickHouse | refs/heads/ | main   | clickhouse-operator                      | 2026-06-02T21:42:29Z | nil | nil | https://github.com/ClickHouse/clickhouse-operator                      |
|    1199 | ClickHouse | refs/heads/ | main   | clickhouse-rs                            | 2026-06-02T21:01:36Z | nil | nil | https://github.com/ClickHouse/clickhouse-rs                            |
|    5720 | ClickHouse | refs/heads/ | main   | clickhouse-go                            | 2026-06-02T19:33:43Z | nil | nil | https://github.com/ClickHouse/clickhouse-go                            |
|    3512 | ClickHouse | refs/heads/ | main   | CostBench                                | 2026-06-02T16:12:37Z | nil | nil | https://github.com/ClickHouse/CostBench                                |
|      18 | ClickHouse | refs/heads/ | main   | dotnet-otel-clickstack-demo              | 2026-06-02T16:11:02Z | nil | nil | https://github.com/ClickHouse/dotnet-otel-clickstack-demo              |
|   30255 | ClickHouse | refs/heads/ | main   | click-ui                                 | 2026-06-02T15:58:04Z | nil | nil | https://github.com/ClickHouse/click-ui                                 |
|     399 | ClickHouse | refs/heads/ | main   | ClickHouse.EntityFrameworkCore           | 2026-06-02T15:32:30Z | nil | nil | https://github.com/ClickHouse/ClickHouse.EntityFrameworkCore           |
|   13747 | ClickHouse | refs/heads/ | main   | clickhouse-java                          | 2026-06-02T15:25:36Z | nil | nil | https://github.com/ClickHouse/clickhouse-java                          |
|   64072 | ClickHouse | refs/heads/ | main   | kubenetmon                               | 2026-06-02T10:30:37Z | nil | nil | https://github.com/ClickHouse/kubenetmon                               |
|     581 | ClickHouse | refs/heads/ | main   | mcp-clickhouse                           | 2026-06-02T08:55:21Z | nil | nil | https://github.com/ClickHouse/mcp-clickhouse                           |
|    3461 | ClickHouse | refs/heads/ | main   | tpc-h-openhouse                          | 2026-06-02T08:46:55Z | nil | nil | https://github.com/ClickHouse/tpc-h-openhouse                          |
|     847 | ClickHouse | refs/heads/ | main   | JSONBench                                | 2026-06-02T08:14:29Z | nil | nil | https://github.com/ClickHouse/JSONBench                                |
|     638 | ClickHouse | refs/heads/ | main   | ai-sdk-cpp                               | 2026-06-02T06:54:35Z | nil | nil | https://github.com/ClickHouse/ai-sdk-cpp                               |
|      40 | ClickHouse | refs/heads/ | main   | byoc-tools                               | 2026-06-02T03:15:30Z | nil | nil | https://github.com/ClickHouse/byoc-tools                               |
|     782 | ClickHouse | refs/heads/ | main   | librechat-admin-panel                    | 2026-06-02T01:29:31Z | nil | nil | https://github.com/ClickHouse/librechat-admin-panel                    |
|    2784 | ClickHouse | refs/heads/ | main   | clickhouse-connect                       | 2026-06-01T21:56:28Z | nil | nil | https://github.com/ClickHouse/clickhouse-connect                       |
|      94 | ClickHouse | refs/heads/ | main   | clickhouse-claude-code-plugin            | 2026-06-01T20:28:50Z | nil | nil | https://github.com/ClickHouse/clickhouse-claude-code-plugin            |
|      52 | ClickHouse | refs/heads/ | main   | clickhouse-kiro-power                    | 2026-06-01T20:28:38Z | nil | nil | https://github.com/ClickHouse/clickhouse-kiro-power                    |
|      41 | ClickHouse | refs/heads/ | main   | clickhouse-cursor-plugin                 | 2026-06-01T20:28:17Z | nil | nil | https://github.com/ClickHouse/clickhouse-cursor-plugin                 |
|     113 | ClickHouse | refs/heads/ | main   | adbc_clickhouse                          | 2026-06-01T16:25:13Z | nil | nil | https://github.com/ClickHouse/adbc_clickhouse                          |
|     223 | ClickHouse | refs/heads/ | main   | agent-skills                             | 2026-06-01T11:47:45Z | nil | nil | https://github.com/ClickHouse/agent-skills                             |
|     113 | ClickHouse | refs/heads/ | main   | Serilog.Sinks.ClickHouse                 | 2026-06-01T09:21:54Z | nil | nil | https://github.com/ClickHouse/Serilog.Sinks.ClickHouse                 |
|     658 | ClickHouse | refs/heads/ | main   | gitTrends                                | 2026-06-01T08:56:14Z | nil | nil | https://github.com/ClickHouse/gitTrends                                |
|     401 | ClickHouse | refs/heads/ | main   | ClickStack-helm-charts                   | 2026-06-01T01:29:54Z | nil | nil | https://github.com/ClickHouse/ClickStack-helm-charts                   |
|     221 | ClickHouse | refs/heads/ | main   | agentic-data-stack                       | 2026-06-01T00:42:28Z | nil | nil | https://github.com/ClickHouse/agentic-data-stack                       |
|     160 | ClickHouse | refs/heads/ | main   | PostgresBench                            | 2026-05-31T23:56:13Z | nil | nil | https://github.com/ClickHouse/PostgresBench                            |
| 3724488 | ClickHouse | refs/heads/ | master | clickhouse-presentations                 | 2026-05-31T11:35:40Z | nil | nil | https://github.com/ClickHouse/clickhouse-presentations                 |
|     646 | ClickHouse | refs/heads/ | main   | github-explorer                          | 2026-05-31T09:16:46Z | nil | nil | https://github.com/ClickHouse/github-explorer                          |
|     481 | ClickHouse | refs/heads/ | master | alexeyprompts                            | 2026-05-31T04:03:04Z | nil | nil | https://github.com/ClickHouse/alexeyprompts                            |
|      16 | ClickHouse | refs/heads/ | main   | clickhouse-serilog-demo                  | 2026-05-30T21:13:42Z | nil | nil | https://github.com/ClickHouse/clickhouse-serilog-demo                  |
|    1043 | ClickHouse | refs/heads/ | main   | ClickCannon                              | 2026-05-30T16:48:32Z | nil | nil | https://github.com/ClickHouse/ClickCannon                              |
|      81 | ClickHouse | refs/heads/ | master | libgsasl                                 | 2026-05-30T15:43:33Z | nil | nil | https://github.com/ClickHouse/libgsasl                                 |
|    4934 | ClickHouse | refs/heads/ | main   | stock-anomaly-udf                        | 2026-05-30T02:46:56Z | nil | nil | https://github.com/ClickHouse/stock-anomaly-udf                        |
|    2579 | ClickHouse | refs/heads/ | main   | ch-go                                    | 2026-05-29T14:40:04Z | nil | nil | https://github.com/ClickHouse/ch-go                                    |
|     162 | ClickHouse | refs/heads/ | main   | docker-library                           | 2026-05-29T13:07:13Z | nil | nil | https://github.com/ClickHouse/docker-library                           |
|      60 | ClickHouse | refs/heads/ | main   | pg_re2                                   | 2026-05-27T15:02:31Z | nil | nil | https://github.com/ClickHouse/pg_re2                                   |
|     760 | ClickHouse | refs/heads/ | main   | clickhouse-fivetran-destination          | 2026-05-27T09:09:42Z | nil | nil | https://github.com/ClickHouse/clickhouse-fivetran-destination          |
|    9799 | ClickHouse | refs/heads/ | master | clickhouse-odbc                          | 2026-05-27T04:22:13Z | nil | nil | https://github.com/ClickHouse/clickhouse-odbc                          |
|   25928 | ClickHouse | refs/heads/ | main   | NoiSQL                                   | 2026-05-26T17:24:08Z | nil | nil | https://github.com/ClickHouse/NoiSQL                                   |
|      81 | ClickHouse | refs/heads/ | main   | hn-news-analyzer                         | 2026-05-26T17:07:50Z | nil | nil | https://github.com/ClickHouse/hn-news-analyzer                         |
|    1568 | ClickHouse | refs/heads/ | master | houseofagents                            | 2026-05-26T11:05:24Z | nil | nil | https://github.com/ClickHouse/houseofagents                            |
|    3887 | ClickHouse | refs/heads/ | main   | clickpy                                  | 2026-05-26T00:00:04Z | nil | nil | https://github.com/ClickHouse/clickpy                                  |
|     277 | ClickHouse | refs/heads/ | main   | ClickHouse.Aspire                        | 2026-05-25T12:44:05Z | nil | nil | https://github.com/ClickHouse/ClickHouse.Aspire                        |
|    1259 | ClickHouse | refs/heads/ | main   | clickhouse-academy                       | 2026-05-24T04:37:11Z | nil | nil | https://github.com/ClickHouse/clickhouse-academy                       |
|    5035 | ClickHouse | refs/heads/ | master | velocity                                 | 2026-05-22T21:26:18Z | nil | nil | https://github.com/ClickHouse/velocity                                 |
|     217 | ClickHouse | refs/heads/ | main   | stockhouse                               | 2026-05-22T11:46:01Z | nil | nil | https://github.com/ClickHouse/stockhouse                               |
|      53 | ClickHouse | refs/heads/ | main   | clickhouse-go-linter                     | 2026-05-22T09:32:00Z | nil | nil | https://github.com/ClickHouse/clickhouse-go-linter                     |
|      27 | ClickHouse | refs/heads/ | main   | clickhouse-wasm-udf-rs                   | 2026-05-22T07:29:27Z | nil | nil | https://github.com/ClickHouse/clickhouse-wasm-udf-rs                   |
|     115 | ClickHouse | refs/heads/ | master | ch2rs                                    | 2026-05-21T15:26:12Z | nil | nil | https://github.com/ClickHouse/ch2rs                                    |
|  375998 | ClickHouse | refs/heads/ | main   | adsb.exposed                             | 2026-05-21T15:26:01Z | nil | nil | https://github.com/ClickHouse/adsb.exposed                             |
|      48 | ClickHouse | refs/heads/ | main   | ch-migrator-example                      | 2026-05-21T15:23:40Z | nil | nil | https://github.com/ClickHouse/ch-migrator-example                      |
|     462 | ClickHouse | refs/heads/ | main   | ClickBOM                                 | 2026-05-20T18:59:12Z | nil | nil | https://github.com/ClickHouse/ClickBOM                                 |
|    7843 | ClickHouse | refs/heads/ | main   | clickhouse.build                         | 2026-05-20T09:49:42Z | nil | nil | https://github.com/ClickHouse/clickhouse.build                         |
|   60360 | ClickHouse | refs/heads/ | main   | ClickHouse_Demos                         | 2026-05-20T04:12:20Z | nil | nil | https://github.com/ClickHouse/ClickHouse_Demos                         |
|      15 | ClickHouse | refs/heads/ | main   | integrations-shared-workflows            | 2026-05-19T08:33:31Z | nil | nil | https://github.com/ClickHouse/integrations-shared-workflows            |
|    1138 | ClickHouse | refs/heads/ | main   | multiagent-terminal                      | 2026-05-18T19:13:51Z | nil | nil | https://github.com/ClickHouse/multiagent-terminal                      |
|     660 | ClickHouse | refs/heads/ | main   | clickhouse-analyzer                      | 2026-05-18T17:22:04Z | nil | nil | https://github.com/ClickHouse/clickhouse-analyzer                      |
|     450 | ClickHouse | refs/heads/ | main   | terraform-provider-clickhousedbops       | 2026-05-18T10:02:26Z | nil | nil | https://github.com/ClickHouse/terraform-provider-clickhousedbops       |
|      70 | ClickHouse | refs/heads/ | main   | power-bi-clickhouse                      | 2026-05-17T22:13:08Z | nil | nil | https://github.com/ClickHouse/power-bi-clickhouse                      |
|   13878 | ClickHouse | refs/heads/ | main   | HouseClick                               | 2026-05-17T14:27:01Z | nil | nil | https://github.com/ClickHouse/HouseClick                               |
|    1230 | ClickHouse | refs/heads/ | master | clickhouse_exporter                      | 2026-05-16T23:57:31Z | nil | nil | https://github.com/ClickHouse/clickhouse_exporter                      |
|      61 | ClickHouse | refs/heads/ | main   | aws_vpc_logs_demo                        | 2026-05-14T01:07:23Z | nil | nil | https://github.com/ClickHouse/aws_vpc_logs_demo                        |
|      97 | ClickHouse | refs/heads/ | main   | ClickHouse.SemanticKernel                | 2026-05-13T12:27:54Z | nil | nil | https://github.com/ClickHouse/ClickHouse.SemanticKernel                |
|     235 | ClickHouse | refs/heads/ | main   | tachikoma                                | 2026-05-13T05:05:02Z | nil | nil | https://github.com/ClickHouse/tachikoma                                |

#+name: orgReposExclude
| .github                  |
| clickhouse-presentations |
| clickhouse-docs          |
| mintlify-docs-dev        |
| rust_vendor              |
| adsb.exposed             |
| grpc                     |

#+name: orgReposXML
#+begin_src emacs-lisp :var repos=orgRepos repos-exclude=orgReposExclude :results value html
(let* ((repos-exclude (flatten-list repos-exclude)))
  (thread-first
    (thread-last
      repos
      (seq-filter (lambda (el) (not (a-get* el 'isArchived))))
      (seq-filter (lambda (el) (not (a-get* el 'isFork))))
      (seq-filter (lambda (el) (not (member (a-get* el 'name) repos-exclude))))
      (mapcar (lambda (el)
                (let* ((raw-name (a-get* el 'name))
                       (path-dirs (list "clickhouse" raw-name))

                       ;; (path-dirs (cond (repo-core? (list "core" raw-name))
                       ;;                 (t (list "misc" raw-name))))

                       (path (string-join path-dirs "/"))
                       (ref (concat (a-get* el 'defaultBranchRef 'prefix)
                                    (a-get* el 'defaultBranchRef 'name)))
                       (name (string-join (list (a-get* el 'owner 'login)
                                                (a-get* el 'name)) "/")))
                  (concat "<project"
                          " name=\"" name
                          "\" path=\"" path
                          "\" revision=\"" ref "\" remote=\"github\"/>")))))
    (cl-sort 'string-lessp :key 'downcase)
    (string-join "\n")))
#+end_src

#+RESULTS: orgXML
#+begin_export html
<project name="ClickHouse/adbc_clickhouse" path="clickhouse/adbc_clickhouse" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/agent-skills" path="clickhouse/agent-skills" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/agentic-data-stack" path="clickhouse/agentic-data-stack" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/ai-sdk-cpp" path="clickhouse/ai-sdk-cpp" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/alexeyprompts" path="clickhouse/alexeyprompts" revision="refs/heads/master" remote="github"/>
<project name="ClickHouse/aspire-clickhouse-gateway-analytics-demo" path="clickhouse/aspire-clickhouse-gateway-analytics-demo" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/aws_vpc_logs_demo" path="clickhouse/aws_vpc_logs_demo" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/byoc-tools" path="clickhouse/byoc-tools" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/ch-go" path="clickhouse/ch-go" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/ch-migrator-example" path="clickhouse/ch-migrator-example" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/ch2rs" path="clickhouse/ch2rs" revision="refs/heads/master" remote="github"/>
<project name="ClickHouse/click-ui" path="clickhouse/click-ui" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/ClickBench" path="clickhouse/ClickBench" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/ClickBOM" path="clickhouse/ClickBOM" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/ClickCannon" path="clickhouse/ClickCannon" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/ClickHouse" path="clickhouse/ClickHouse" revision="refs/heads/master" remote="github"/>
<project name="ClickHouse/clickhouse-academy" path="clickhouse/clickhouse-academy" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse-analyzer" path="clickhouse/clickhouse-analyzer" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse-c" path="clickhouse/clickhouse-c" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse-claude-code-plugin" path="clickhouse/clickhouse-claude-code-plugin" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse-connect" path="clickhouse/clickhouse-connect" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse-cpp" path="clickhouse/clickhouse-cpp" revision="refs/heads/master" remote="github"/>
<project name="ClickHouse/clickhouse-cs" path="clickhouse/clickhouse-cs" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse-cursor-plugin" path="clickhouse/clickhouse-cursor-plugin" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse-fivetran-destination" path="clickhouse/clickhouse-fivetran-destination" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse-go" path="clickhouse/clickhouse-go" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse-go-linter" path="clickhouse/clickhouse-go-linter" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse-java" path="clickhouse/clickhouse-java" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse-js" path="clickhouse/clickhouse-js" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse-kafka-connect" path="clickhouse/clickhouse-kafka-connect" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse-kiro-power" path="clickhouse/clickhouse-kiro-power" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse-odbc" path="clickhouse/clickhouse-odbc" revision="refs/heads/master" remote="github"/>
<project name="ClickHouse/clickhouse-operator" path="clickhouse/clickhouse-operator" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse-rs" path="clickhouse/clickhouse-rs" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse-serilog-demo" path="clickhouse/clickhouse-serilog-demo" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse-wasm-udf-rs" path="clickhouse/clickhouse-wasm-udf-rs" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/ClickHouse.Aspire" path="clickhouse/ClickHouse.Aspire" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse.build" path="clickhouse/clickhouse.build" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/ClickHouse.EntityFrameworkCore" path="clickhouse/ClickHouse.EntityFrameworkCore" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/ClickHouse.SemanticKernel" path="clickhouse/ClickHouse.SemanticKernel" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/ClickHouse_Demos" path="clickhouse/ClickHouse_Demos" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickhouse_exporter" path="clickhouse/clickhouse_exporter" revision="refs/heads/master" remote="github"/>
<project name="ClickHouse/clickhousectl" path="clickhouse/clickhousectl" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickpy" path="clickhouse/clickpy" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/ClickStack" path="clickhouse/ClickStack" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/clickstack-demo-subscription-app" path="clickhouse/clickstack-demo-subscription-app" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/ClickStack-helm-charts" path="clickhouse/ClickStack-helm-charts" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/CostBench" path="clickhouse/CostBench" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/dbt-clickhouse" path="clickhouse/dbt-clickhouse" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/docker-library" path="clickhouse/docker-library" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/dotnet-otel-clickstack-demo" path="clickhouse/dotnet-otel-clickstack-demo" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/examples" path="clickhouse/examples" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/flink-connector-clickhouse" path="clickhouse/flink-connector-clickhouse" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/github-explorer" path="clickhouse/github-explorer" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/gitTrends" path="clickhouse/gitTrends" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/hn-news-analyzer" path="clickhouse/hn-news-analyzer" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/HouseClick" path="clickhouse/HouseClick" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/houseofagents" path="clickhouse/houseofagents" revision="refs/heads/master" remote="github"/>
<project name="ClickHouse/integrations-shared-workflows" path="clickhouse/integrations-shared-workflows" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/JSONBench" path="clickhouse/JSONBench" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/kubenetmon" path="clickhouse/kubenetmon" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/libgsasl" path="clickhouse/libgsasl" revision="refs/heads/master" remote="github"/>
<project name="ClickHouse/librechat-admin-panel" path="clickhouse/librechat-admin-panel" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/mcp-clickhouse" path="clickhouse/mcp-clickhouse" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/multiagent-terminal" path="clickhouse/multiagent-terminal" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/nerve" path="clickhouse/nerve" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/NoiSQL" path="clickhouse/NoiSQL" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/pg_clickhouse" path="clickhouse/pg_clickhouse" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/pg_re2" path="clickhouse/pg_re2" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/pg_stat_ch" path="clickhouse/pg_stat_ch" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/PostgresBench" path="clickhouse/PostgresBench" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/power-bi-clickhouse" path="clickhouse/power-bi-clickhouse" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/Serilog.Sinks.ClickHouse" path="clickhouse/Serilog.Sinks.ClickHouse" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/silk" path="clickhouse/silk" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/spark-clickhouse-connector" path="clickhouse/spark-clickhouse-connector" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/stock-anomaly-udf" path="clickhouse/stock-anomaly-udf" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/stockhouse" path="clickhouse/stockhouse" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/tachikoma" path="clickhouse/tachikoma" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/terraform-provider-clickhouse" path="clickhouse/terraform-provider-clickhouse" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/terraform-provider-clickhousedbops" path="clickhouse/terraform-provider-clickhousedbops" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/tpc-h-openhouse" path="clickhouse/tpc-h-openhouse" revision="refs/heads/main" remote="github"/>
<project name="ClickHouse/velocity" path="clickhouse/velocity" revision="refs/heads/master" remote="github"/>
#+end_export

* Using legacy =ghub-graphql=
** Docs

+ [[https://medium.com/@tharshita13/github-graphql-api-cheatsheet-38e916fe76a3][Github GraphQL Cheatsheet]]

See [[https://github.com/magit/ghub/blob/main/lisp/ghub-graphql.el][ghub-graphql.el]] in [[https://github.com/magit/ghub][magit/ghub]] for API, particularly the queries defined as
=defconstant= like =ghub-fetch-repository= and the matching =cl-defun=.

And see [[https://github.com/vermiculus/graphql.el][vermiculus/graphql.el]] for graphql queries generally.

#+begin_src emacs-lisp
(setq-local org-confirm-babel-evaluate nil)
#+end_src

*** Query Format for Search Interface

#+begin_src graphql

query($org:String!){
  search (
    type:REPOSITORY,
    query: """
      stars:>100
      size:>2000
      pushed:>=2020-08-08
    """, last: 100) {
    repos: edges {
      repo: node {
        ... on Repository {
          url

          allIssues: issues {
            totalCount
          }
          openIssues: issues(states:OPEN) {
            totalCount
          }
        }
      }
    }
  }
}

#+end_src

** Oh so now I figure it out

Oh and apparently =magit= and =forge= will handle managing an organization's
repositories for you -- including pulling/syncing. I would have known this if
either of two things had happened earlier:

+ I encounter and briefly work alongside someone who needs to read source code
  in volume (probably someone from San Francisco, not Roanoke)
+ I had gotten my GPG key to enable integrating Emacs API's earlier.

I've been thinking about managing code like this using repo with automated XML
for 2+ years at least. Oh, but now that I go to see if I can "add a repository"
using Forge for the exact same thing -- oh that's when I find out how you do
these things.

Is it any wonder that most open source is 99% corporate if you can't easily pull
the KDE or Gnome repositories? As in all of them -- without running a custom ISO
like KDE Neon. And I guess you can get that from the source RPM's, but who is
going to tell you that? Nobody.

Repo is still better for this purpose though.

** Querying repositories

#+begin_example emacs-lisp
(graphql-query
 (myField1 myField2 (myEdges (edges (node myField3)))))
#+end_example

#+RESULTS:
: query{__schema{types{name{kind description fields{name}}}}}

*** Check API Rate Limit

Running each block with a =:var= that references another block will run that
again.

#+begin_src emacs-lisp :results value code :exports code
(ghub-graphql-rate-limit)
#+end_src

#+RESULTS:
#+begin_src emacs-lisp
((limit . 5000)
 (cost . 1)
 (remaining . 5000)
 (resetAt . "2023-05-01T23:35:35Z"))
#+end_src

*** List An Organization's Repositories

Get the core repositories. These should go into =/data/ecto/tensorflow/core=.

#+name: nrepos
#+begin_src emacs-lisp
100
#+end_src

#+RESULTS: nrepos
: 100

#+name: tensorflow-repos
#+begin_src emacs-lisp :var nrepos=200 :results replace vector value :exports code :noweb yes
(ghub-graphql
 (graphql-query ((organization
                  :arguments ((login . "tensorflow"))
                  (repositories
                   :arguments ((first . <<nrepos()>>)
                               (orderBy . ((field . UPDATED_AT)
                                           (direction . DESC))))
                   (edges
                    (node (owner login)
                          name
                          (defaultBranchRef prefix name)
                          url
                          updatedAt
                          isArchived)))))))
#+end_src


This query inflates to the following graphql and can be run on the [[https://docs.github.com/en/graphql/overview/explorer][Github Graph
Explorer]], which is obnoxiously hard to find from Google when you need it.

#+begin_example graphql
{
  organization(login: "tensorflow") {
    repositories(
      first: 100
      orderBy: {field: UPDATED_AT, direction: DESC}
    ) {
      edges {
        node {
          owner {
            login
          }
          name
          defaultBranchRef {
            prefix
            name
          }
          url
          updatedAt
          isArchived
        }
      }
    }
  }
}
#+end_example

**** Convert to XML

All hail =ripgrep=. The browser is dead.

#+name: tensorflow-core
#+begin_src emacs-lisp :var gqldata=tensorflow-repos :results value html
(thread-first
  (thread-last
    (a-get* (nthcdr 0 gqldata) 'data 'organization 'repositories 'edges)
    (mapcar (lambda (el) (a-get* el 'node)))
    (seq-filter (lambda (el) (not (a-get* el 'isArchived))))
    (mapcar (lambda (el)
              (let* (;; (defaultBranchRef (a-get* 'defaultBranchRef))
                     (path (a-get* el 'name))
                     (ref (concat (a-get* el 'defaultBranchRef 'prefix)
                                  (a-get* el 'defaultBranchRef 'name)))
                     (name (string-join (list (a-get* el 'owner 'login)
                                              (a-get* el 'name)) "/")))
                (concat "<project"
                        " name=\"" name
                        "\" path=\"" path
                        "\" ref=\"" ref "\" remote=\"github\" />")))))
  (cl-sort 'string-lessp :key 'downcase)
  (string-join "\n"))
#+end_src

#+RESULTS: tensorflow-core
#+begin_export html
<project name="tensorflow/.allstar" path=".allstar" ref="refs/heads/master" remote="github" />
<project name="tensorflow/adanet" path="adanet" ref="refs/heads/master" remote="github" />
<project name="tensorflow/addons" path="addons" ref="refs/heads/master" remote="github" />
<project name="tensorflow/agents" path="agents" ref="refs/heads/master" remote="github" />
<project name="tensorflow/benchmarks" path="benchmarks" ref="refs/heads/master" remote="github" />
<project name="tensorflow/build" path="build" ref="refs/heads/master" remote="github" />
<project name="tensorflow/cloud" path="cloud" ref="refs/heads/master" remote="github" />
<project name="tensorflow/codelabs" path="codelabs" ref="refs/heads/main" remote="github" />
<project name="tensorflow/community" path="community" ref="refs/heads/master" remote="github" />
<project name="tensorflow/compression" path="compression" ref="refs/heads/master" remote="github" />
<project name="tensorflow/custom-op" path="custom-op" ref="refs/heads/master" remote="github" />
<project name="tensorflow/data-validation" path="data-validation" ref="refs/heads/master" remote="github" />
<project name="tensorflow/datasets" path="datasets" ref="refs/heads/master" remote="github" />
<project name="tensorflow/decision-forests" path="decision-forests" ref="refs/heads/main" remote="github" />
<project name="tensorflow/deepmath" path="deepmath" ref="refs/heads/master" remote="github" />
<project name="tensorflow/docs" path="docs" ref="refs/heads/master" remote="github" />
<project name="tensorflow/docs-l10n" path="docs-l10n" ref="refs/heads/master" remote="github" />
<project name="tensorflow/dtensor-gcp-examples" path="dtensor-gcp-examples" ref="refs/heads/main" remote="github" />
<project name="tensorflow/ecosystem" path="ecosystem" ref="refs/heads/master" remote="github" />
<project name="tensorflow/embedding-projector-standalone" path="embedding-projector-standalone" ref="refs/heads/master" remote="github" />
<project name="tensorflow/estimator" path="estimator" ref="refs/heads/master" remote="github" />
<project name="tensorflow/examples" path="examples" ref="refs/heads/master" remote="github" />
<project name="tensorflow/fairness-indicators" path="fairness-indicators" ref="refs/heads/master" remote="github" />
<project name="tensorflow/federated" path="federated" ref="refs/heads/main" remote="github" />
<project name="tensorflow/fold" path="fold" ref="refs/heads/master" remote="github" />
<project name="tensorflow/gan" path="gan" ref="refs/heads/master" remote="github" />
<project name="tensorflow/gnn" path="gnn" ref="refs/heads/main" remote="github" />
<project name="tensorflow/graphics" path="graphics" ref="refs/heads/master" remote="github" />
<project name="tensorflow/haskell" path="haskell" ref="refs/heads/master" remote="github" />
<project name="tensorflow/hub" path="hub" ref="refs/heads/master" remote="github" />
<project name="tensorflow/io" path="io" ref="refs/heads/master" remote="github" />
<project name="tensorflow/java" path="java" ref="refs/heads/master" remote="github" />
<project name="tensorflow/java-models" path="java-models" ref="refs/heads/master" remote="github" />
<project name="tensorflow/java-ndarray" path="java-ndarray" ref="refs/heads/main" remote="github" />
<project name="tensorflow/kfac" path="kfac" ref="refs/heads/master" remote="github" />
<project name="tensorflow/lattice" path="lattice" ref="refs/heads/master" remote="github" />
<project name="tensorflow/lingvo" path="lingvo" ref="refs/heads/master" remote="github" />
<project name="tensorflow/lucid" path="lucid" ref="refs/heads/master" remote="github" />
<project name="tensorflow/mesh" path="mesh" ref="refs/heads/master" remote="github" />
<project name="tensorflow/metadata" path="metadata" ref="refs/heads/master" remote="github" />
<project name="tensorflow/mlir-hlo" path="mlir-hlo" ref="refs/heads/master" remote="github" />
<project name="tensorflow/model-analysis" path="model-analysis" ref="refs/heads/master" remote="github" />
<project name="tensorflow/model-card-toolkit" path="model-card-toolkit" ref="refs/heads/main" remote="github" />
<project name="tensorflow/model-optimization" path="model-optimization" ref="refs/heads/master" remote="github" />
<project name="tensorflow/model-remediation" path="model-remediation" ref="refs/heads/master" remote="github" />
<project name="tensorflow/models" path="models" ref="refs/heads/master" remote="github" />
<project name="tensorflow/networking" path="networking" ref="refs/heads/master" remote="github" />
<project name="tensorflow/neural-structured-learning" path="neural-structured-learning" ref="refs/heads/master" remote="github" />
<project name="tensorflow/nmt" path="nmt" ref="refs/heads/master" remote="github" />
<project name="tensorflow/oss-fuzz" path="oss-fuzz" ref="refs/heads/master" remote="github" />
<project name="tensorflow/playground" path="playground" ref="refs/heads/master" remote="github" />
<project name="tensorflow/privacy" path="privacy" ref="refs/heads/master" remote="github" />
<project name="tensorflow/probability" path="probability" ref="refs/heads/main" remote="github" />
<project name="tensorflow/profiler" path="profiler" ref="refs/heads/master" remote="github" />
<project name="tensorflow/profiler-ui" path="profiler-ui" ref="refs/heads/master" remote="github" />
<project name="tensorflow/quantum" path="quantum" ref="refs/heads/master" remote="github" />
<project name="tensorflow/ranking" path="ranking" ref="refs/heads/master" remote="github" />
<project name="tensorflow/recommenders" path="recommenders" ref="refs/heads/main" remote="github" />
<project name="tensorflow/recommenders-addons" path="recommenders-addons" ref="refs/heads/master" remote="github" />
<project name="tensorflow/runtime" path="runtime" ref="refs/heads/master" remote="github" />
<project name="tensorflow/rust" path="rust" ref="refs/heads/master" remote="github" />
<project name="tensorflow/serving" path="serving" ref="refs/heads/master" remote="github" />
<project name="tensorflow/sig-tfjs" path="sig-tfjs" ref="refs/heads/main" remote="github" />
<project name="tensorflow/similarity" path="similarity" ref="refs/heads/master" remote="github" />
<project name="tensorflow/swift-apis" path="swift-apis" ref="refs/heads/main" remote="github" />
<project name="tensorflow/tcav" path="tcav" ref="refs/heads/master" remote="github" />
<project name="tensorflow/tensor2tensor" path="tensor2tensor" ref="refs/heads/master" remote="github" />
<project name="tensorflow/tensorboard" path="tensorboard" ref="refs/heads/master" remote="github" />
<project name="tensorflow/tensorflow" path="tensorflow" ref="refs/heads/master" remote="github" />
<project name="tensorflow/tensorrt" path="tensorrt" ref="refs/heads/master" remote="github" />
<project name="tensorflow/text" path="text" ref="refs/heads/master" remote="github" />
<project name="tensorflow/tf-build-actions" path="tf-build-actions" ref="refs/heads/master" remote="github" />
<project name="tensorflow/tfhub.dev" path="tfhub.dev" ref="refs/heads/master" remote="github" />
<project name="tensorflow/tfjs" path="tfjs" ref="refs/heads/master" remote="github" />
<project name="tensorflow/tfjs-examples" path="tfjs-examples" ref="refs/heads/master" remote="github" />
<project name="tensorflow/tfjs-models" path="tfjs-models" ref="refs/heads/master" remote="github" />
<project name="tensorflow/tfjs-website" path="tfjs-website" ref="refs/heads/master" remote="github" />
<project name="tensorflow/tfjs-wechat" path="tfjs-wechat" ref="refs/heads/master" remote="github" />
<project name="tensorflow/tflite-micro" path="tflite-micro" ref="refs/heads/main" remote="github" />
<project name="tensorflow/tflite-micro-arduino-examples" path="tflite-micro-arduino-examples" ref="refs/heads/main" remote="github" />
<project name="tensorflow/tflite-support" path="tflite-support" ref="refs/heads/master" remote="github" />
<project name="tensorflow/tfx" path="tfx" ref="refs/heads/master" remote="github" />
<project name="tensorflow/tfx-addons" path="tfx-addons" ref="refs/heads/main" remote="github" />
<project name="tensorflow/tfx-bsl" path="tfx-bsl" ref="refs/heads/master" remote="github" />
<project name="tensorflow/toolchains" path="toolchains" ref="refs/heads/master" remote="github" />
<project name="tensorflow/tpu" path="tpu" ref="refs/heads/master" remote="github" />
<project name="tensorflow/transform" path="transform" ref="refs/heads/master" remote="github" />
#+end_export

** Querying Schema

*** with ghub

Okay jebus it's 11,500 lines long (and in my kill-ring)

**** Types

***** Repository

#+name: github-type-repository
#+header-args: :mkdirp t
#+begin_src emacs-lisp :results value none :exports both
(ghub-graphql
 (graphql-query ((__type :arguments ((name . "Repository"))
                         name kind description (fields (name))))))
#+end_src

**** Full Schema

#+name: github-schema
#+begin_src emacs-lisp :results value file silent :exports code
(ghub-graphql
 (graphql-query ((__schema (types name kind description (fields (name)))))))
#+end_src

**** Dump Schema to JSON

Hmmm, but i need an =sdl= file

#+begin_src emacs-lisp :results value file silent :exports both :file (expand-file-name "assets/github.sdl" (cdr (project-current)))
(json-encode
 (ghub-graphql
  (graphql-query ((__schema (types name kind description (fields (name))))))))
#+end_src

And for a single type

#+begin_src emacs-lisp :results value none :exports both
(json-encode
 (ghub-graphql
  (graphql-query ((__type :arguments ((name . "Repository"))
                          name kind description (fields (name)))))))
#+end_src

*** WIth ob-graphql

I can't get this to work. It doesn't accept the authorization token.

#+name: graphql-headers
#+begin_src emacs-lisp
'(("Authorization" . "token mytokenhere"))
#+end_src

#+name: obgql-schema-full
#+header: :url https://api.github.com/graphql :headers graphql-headers
#+begin_src graphql :results output :file github.sdl :exports code
##+begin_src graphql :results output file :file github.sdl :exports code
##+begin_src graphql :results value :file github.sdl :exports code
query{
  __schema{
    types{
      name
      kind
      description
      fields{name}
    }
  }
}
#+end_src

*** With ob-restclient

#+name: gql-query-schema
#+begin_example graphql
query {
  __schema {
    types {
      name
      kind
      description
      fields { name }
    }
  }
}
#+end_example

#+name: gql-request-schema
#+header: :var token=(identity ghub-graphql-token) query=gql-query-schema
#+begin_src restclient
# Authorization: Bearer :token
POST https://api.github.com/graphql
Authorization: Bearer :token
Content-Type: application/json
User-Agent: Emacs

{
  "query": ":query",
  "variables": {}
}
#+end_src

#+RESULTS: gql-request-schema
#+BEGIN_SRC js
{
  "message": "Problems parsing JSON",
  "documentation_url": "https://docs.github.com/graphql"
}
// POST https://api.github.com/graphql
// HTTP/1.1 400 Bad Request
// Server: GitHub.com
// Date: Mon, 01 May 2023 23:33:45 GMT
// Content-Type: application/json; charset=utf-8
// Content-Length: 89
// X-OAuth-Scopes:
// X-Accepted-OAuth-Scopes: repo
// github-authentication-token-expiration: 2023-05-31 16:32:23 UTC
// X-GitHub-Media-Type: github.v4; format=json
// X-RateLimit-Limit: 5000
// X-RateLimit-Remaining: 4999
// X-RateLimit-Reset: 1682986006
// X-RateLimit-Used: 1
// X-RateLimit-Resource: graphql
// Access-Control-Expose-Headers: ETag, Link, Location, Retry-After, X-GitHub-OTP, X-RateLimit-Limit, X-RateLimit-Remaining, X-RateLimit-Used, X-RateLimit-Resource, X-RateLimit-Reset, X-OAuth-Scopes, X-Accepted-OAuth-Scopes, X-Poll-Interval, X-GitHub-Media-Type, X-GitHub-SSO, X-GitHub-Request-Id, Deprecation, Sunset
// Access-Control-Allow-Origin: *
// Strict-Transport-Security: max-age=31536000; includeSubdomains; preload
// X-Frame-Options: deny
// X-Content-Type-Options: nosniff
// X-XSS-Protection: 0
// Referrer-Policy: origin-when-cross-origin, strict-origin-when-cross-origin
// Content-Security-Policy: default-src 'none'
// Vary: Accept-Encoding, Accept, X-Requested-With
// X-GitHub-Request-Id: 818B:4D2A:894CA1:117BEF0:64504C59
// Request duration: 0.077842s
#+END_SRC


#+name: curl-gql-request-test
#+headers: :var token=(identity ghub-graphql-token) query=gql-query-schema
#+begin_src sh :results output
body='{ "query": "'$query'", "variables": {} }'

echo $body
echo $body | jq
#+end_src

#+RESULTS: curl-gql-request-test
: { "query": "query{ __schema{ types{ name kind description fields{name} } } } ", "variables": {} }
: {
:   "query": "query{ __schema{ types{ name kind description fields{name} } } } ",
:   "variables": {}
: }

When the quotes are too close to the brackets ='{"query": "'$query'",
"variables": {}}'= i get an error


#+name: curl-gql-request-schema
#+headers: :var token=(identity ghub-graphql-token) query=gql-query-schema
#+begin_src sh :results output :noweb t
body='{ "query": "'$query'", "variables": {} }'
#-H "Authorization: token $token" \

echo "'"$body"'"
echo $body

body=$(echo $body | tr -d '\n')

echo curl -g -X POST --silent -H "Content-Type: application/json" -H "Authorization: Bearer $token" -d $body https://api.github.com/graphql
#echo curl -g -X POST --silent -H "Content-Type: application/json" -H "Authorization: Bearer $token" -d $body https://api.github.com/graphql

curl -g -X POST \
     --silent \
     -H "Content-Type: application/json" \
     -H "Authorization: Bearer $token" \
     --data $body \
     https://api.github.com/graphql

#     -d '{ "query": "query{ __schema{ types{ name kind description fields{name} } } } ", "variables": {} }' \
#     -d '"'$body'"' \
#     -d "'"$body"'" \
#echo $foovar
#+end_src

#+RESULTS: curl-gql-request-schema
: '{ "query": "query{ __schema{ types{ name kind description fields{name} } } } ", "variables": {} }'
: { "query": "query{ __schema{ types{ name kind description fields{name} } } } ", "variables": {} }
: {"errors":[{"message":"A query attribute must be specified and must be a string."}]}
